CrazyLib/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def search
    if params[:keyword]
      @books = Book.search(params[:filter].to_i ,params[:keyword])