trunk/CrazyLib/app/controllers/admin_controller.rb

  def show_transactions
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"