trunk/CrazyLib/app/controllers/books_controller.rb

  def index
    @books = Book.all

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @books }
    end
    @sciences = Book.find(:all,:limit=>8,:conditions=>{:topic=>1});
---
SELECT "books".* FROM "books" WHERE "books"."topic" = 1 LIMIT 8