trunk/CrazyLib/app/controllers/books_controller.rb

SELECT DISTINCT topic FROM "books"
SELECT "books".* FROM "books" WHERE "books"."topic" = 1
---
  def index
    topics = Book.select(:topic).uniq
    @books = Array.new
    topics.each do |topic|

SELECT "books".* FROM "books"
---
  def search
    if params[:keyword]
      @books = Book.search(params[:filter].to_i ,params[:keyword])